# Terminal & shell
brew "tmux"
brew "bash"                             # macOS ships 3.2, need 5.x for tsl()
brew "neovim"
brew "starship"

# Shell enhancements
brew "eza"                              # modern ls
brew "fzf"                              # fuzzy finder
brew "zoxide"                           # smart cd
brew "bat"                              # cat with syntax highlighting
brew "ripgrep"                          # fast grep (used by nvim telescope)
brew "fd"                               # fast find (used by nvim telescope)
brew "mise"                             # runtime version manager

# Dev tools
brew "gh"                               # GitHub CLI (git credential helper)
brew "jq"                               # JSON processor
brew "tree"                             # directory tree

# Fonts (needed for terminal + nvim icons)
cask "font-jetbrains-mono-nerd-font"
